In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn
from pandas import Series,DataFrame
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
s=Series([100,200,300],index=['chal','dal','murgi'])

In [4]:
s

chal     100
dal      200
murgi    300
dtype: int64

In [5]:
s['chal']

100

In [6]:
s[0]

100

In [9]:
s[['chal','dal']]

chal    100
dal     200
dtype: int64

In [11]:
s[[0,1]]

chal    100
dal     200
dtype: int64

In [12]:
s[s>150]

dal      200
murgi    300
dtype: int64

In [13]:
s[s>150]=500

In [14]:
s

chal     100
dal      500
murgi    500
dtype: int64

In [15]:
#dataframe grabing---its important

In [16]:
df=DataFrame(np.arange(9).reshape(3,3),index=['a','b','c'],columns=['ami','tumi','tomra'])

In [17]:
df

   ami  tumi  tomra
a    0     1      2
b    3     4      5
c    6     7      8

In [21]:
df['ami']

a    0
b    3
c    6
Name: ami, dtype: int32

In [22]:
#sorasori row select kora jai na ager moto

In [25]:
df.iloc[1]

ami      3
tumi     4
tomra    5
Name: b, dtype: int32

In [27]:
df.ix['a']

C:\Users\sondip\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

ami      0
tumi     1
tomra    2
Name: a, dtype: int32

In [28]:
df.loc['a']

ami      0
tumi     1
tomra    2
Name: a, dtype: int32

In [31]:
df.loc[['a','b']]

   ami  tumi  tomra
a    0     1      2
b    3     4      5

In [35]:
df.iloc[1,2]
#iloc hosse position based indexing
#loc hosse label based indexing
#fantastic

5

In [33]:
df

   ami  tumi  tomra
a    0     1      2
b    3     4      5
c    6     7      8

In [36]:
df.iloc[[1,2]]

   ami  tumi  tomra
b    3     4      5
c    6     7      8

In [37]:
df[df>5]

   ami  tumi  tomra
a  NaN   NaN    NaN
b  NaN   NaN    NaN
c  6.0   7.0    8.0

In [39]:
df>5

     ami   tumi  tomra
a  False  False  False
b  False  False  False
c   True   True   True

In [42]:
df[df>5]=0

In [43]:
df

   ami  tumi  tomra
a    0     1      2
b    3     4      5
c    0     0      0

In [44]:
df.tumi=4

In [47]:
df[df.ami==3]

   ami  tumi  tomra
b    3     4      5

In [48]:
df

   ami  tumi  tomra
a    0     4      2
b    3     4      5
c    0     4      0

In [49]:
df.iloc[1,0]

3

In [51]:
df.loc[['a','b','c','d'],['ami','aj','basai','nei']]

C:\Users\sondip\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   ami  aj  basai  nei
a  0.0 NaN    NaN  NaN
b  3.0 NaN    NaN  NaN
c  0.0 NaN    NaN  NaN
d  NaN NaN    NaN  NaN

In [53]:
df.loc[['a','b','c','d','e']]

C:\Users\sondip\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   ami  tumi  tomra
a  0.0   4.0    2.0
b  3.0   4.0    5.0
c  0.0   4.0    0.0
d  NaN   NaN    NaN
e  NaN   NaN    NaN